import type { GroupedSubmissions } from "#/types/submissions";

export const SUBMISSIONS: Array<GroupedSubmissions> = [
  {
    id: "Z1",
    answer: `คืออาหารของทางฮังการีเนี่ยมันจะมีความเป็นกล่องข้าวน้อยฆ่าแม่นิดนึง ถ้ามองเฉย ๆ เนี่ยอาจจะมองว่าเป็นน้ำซุปเนื้อธรรมดา กินกับขนมปังมันจะอิ่มหรอ พี่สามารถพูดได้เต็มปากเลยว่าอิ่มจนกินไม่หมดกันเลยทีเดียว เพราะอาหารของเขาค่อนข้างจะใช้พื้นที่กระเพาะและที่สำคัญคืออร่อยด้วย`,
    questions: [`อาหารเป็นอย่างไรบ้างครับ อร่อยไหมครับ`],
  },
  {
    id: "Z2",
    answer: `Soon!? 👀 (wink)`,
    questions: [`Suea Talk #2 When Kub`],
  },
  {
    id: "A2+A7",
    answer:
      "ต้องบอกก่อนว่าเป็นนักเรียนห้องวิทย์คณิตที่ใช้ภาษาอังกฤษได้ค่อยข้างดี ผลที่ตามมาคือพี่จะได้มีโอกาสเป็นตัวแทนของโรงเรียนเพื่อไปเข้าแข่งขันทั้งสายวิทย์และภาษาอังกฤษ พอมารู้ตัวอีกทีเพื่อน ๆ ก็ทักว่าเป็นเด็กกิจกรรมแบบ honorary ไปในตัวทั้ง ๆ ในใจมองตัวเองว่าเป็นเด็กเรียนมาตลอด",
    questions: [
      "ตอนเรียนมัธยมเป็นนักเรียนแบบไหน",
      "สมัยเรียนเป็นเด็กกิจกรรมไหม",
    ],
  },
  {
    id: "A13",
    answer:
      "ถ้าให้ตอบจากใจเลยคือไม่เคยกลัว แต่ไม่ใช่เพราะว่าพี่ใช้ภาษาอังกฤษได้ดี กลับเป็นความรู้สึกเฉย ๆ พี่มองว่าท้ายทีสุดแล้วทักษะในการใช้ภาษามันก็เป็นเหมือนกับการขับรถ, ว่ายน้ำ หรือว่าขี่มอไซ เป็นทักษะที่ไม่มีก็ได้ ชีวิตของเราไม่ได้ขึ้นกับสิ่งเหล่านี้ (ยกเว้นว่ายน้ำไว้หนึ่งอัน) แต่ถ้าเรามีทักษะเหล่านี้ การใช้ชีวิตของเรามันก็จะสะดวกสบายขึ้น มีโอกาสในการพัฒนาและเติมโตมากกว่า",
    questions: ["ตอนเด็กเคยกลัวภาษาอังกฤษไหม"],
  },
  {
    id: "B2+B4",
    answer:
      "ที่น่าสนใจมาก ๆ ของตัวทุน Stipendium Hungaricum คือ ทุนตัวนี้มอบให้เปล่า ๆ โดยที่ไม่ต้องใช้คืนหลังจากสำเร็จการศึกษาและอีกส่วนหนึ่งคือทางทุนมีการมอบเงินเดือนให้เป็นค่าใช้จ่ายอีกด้วย 220 ยูโร อีกหนึ้งเหตุผลคือเดิมทีพี่เป็นคนที่มีความสนใจในด้านคอมพิวเตอร์และการเขียนโค้ด ประเทศฮังการีค่อนข้างจะมีนักวิทยาศาสตร์ที่มีชื่อเสียงในด้านนี้ ในตอนสุดท้ายก็เลยได้ตัดสินใจลองดูกันสักตั้ง",
    questions: ["อะไรทําให้สนใจ", "ทําไมถึงตัดสินใจสมัคร"],
  },
  {
    id: "B9",
    answer:
      "ตลอดเวลาที่เรียนประมาณ 3.5 ปี พี่สามารถพูดได้เต็มปากเลยว่าไม่เคยมีเลย ไม่ใช่เพราะว่า 'นี้เป็นทางที่เราเลือกเอง ชดใช้กรรมเอง' แต่เป็นเพราะว่านี้คือที่ที่พี่อยากอยู่จริง ๆ (this is where I belong, this is where I want to be) ทำให้เผ่านเวลาที่คิดว่ายากลำบากมาได้",
    questions: ["มีช่วงที่อยากล้มเลิกไหม"],
  },
  {
    id: "C1+C2+C3+C4",
    answer: `ต้องขอย้อนเรื่องนิดนึงว่า การที่พี่ฝึกทักษะภาษาอังกฤษได้มันเกิดจากความจำเป็นอย่างหนึ่งคือเกิดจากว่าเบื่อ ในตอนที่เข้ามาเรียนอยวตอนม.ต้น พี่ดูยูทูปเยอะมากเพราะสมัยนั้นนักแคสเกมจะมีความนิยมสูงมาก ไม่ว่าจะเป็นวาไรตี้หรือเกมแบบมายคราฟ พี่ไม่แน่ใจว่าสมัยนี้ช่องเหล่านี้ยังเป็นความนิยมอยู่มั้ย แต่ปัญหาของพี่คือพี่ดูจนเบื่อ พี่ก็เลยใช้คำว่า "ลอง" ข้ามไปช่องคนที่พูดอังกฤษดูดีกว่า พี่ก็เลยมีโอกาสฟังคอนเทนต์ที่เป็นภาษาอังกฤษเยอะมา ๆ พอเริ่มฟังออกพี่ก็เริ่มติดใจ เริ่มขยายไปทักษะอื่นอนิเมะเอยหรือหนังเอย พี่ก็จะเลือกดูที่ซับภาษาอังกฤษ ส่วนการพูดเนี่ย อันนี้ค่อนข้างเขิน ๆ นิดนึงเพราะว่าพี่ชอบพูดคนเดียว พี่ก็จะพูดคนเดียวเป็นภาษาอังกฤษเลย ซึ่งถ้าให้พี่พูดจริง ๆ พี่ไม่คิดว่ากิจกรรมเหล่านี้มันเป็นการ "ฝึก" อย่างแท้จริง เพียงแต่เป็นผลพวกของการทำสิ่งที่เราชอบและทำให้เรามีความสุขมากกว่า`,
    questions: [
      "เตรียมภาษาอังกฤษอย่างไร",
      "ฝึกพูดอย่างไร",
      "ฝึกฟังอย่างไร",
      "ดูหนังหรือฟังคอนเทนต์อะไร",
    ],
  },
  {
    id: "D5",
    answer: `เรื่องที่น่าตกใจที่สุดของฮังการี และบูดาเพชคือจำนวนของคนที่สูบบุหรี่ เป็นกิจกรรมที่ทุกเพศและทุกช่วงวัยสามารถทำได้ ตั้งแต่หนุ่มสาวไปจนถึงคุณตาคุณยายทำกัน มีทั้งที่เป็นยาสูบแล้วเอามาม้วนเอง หรือบุหรี่ไฟฟ้า หรือบุหรี่ธรรมดา เวลาที่เดินในเมืองจะสังเกตได้เลยว่าบททางเท้ามีก้นบุหรี่อยู่ค่อนข้างมาก`,
    questions: [`ช็อกทางวัฒนธรรมไหม`],
  },
  {
    id: "D9+D10",
    answer: `เคยมีคิดถึงบ้าง แต่พี่ได้ประสบการณ์ที่สำคัญหนึ่งอย่างตอนที่ไปแลกเปลี่ยนที่นิวซีแลนด์ (ที่โควิดระบาดทำให้กลับไทยไม่ได้) ทริคของพี่คือ ในหนึ่งวันและทุก ๆ วันมีจะแบ่งเวลามาโทรหาที่บ้านอย่างน้อยหนึ่งชั่วโมง ไม่ว่าจะยุ่งขนาดไหนหรือว่าทำอะไรอยู่ จะต้องโทรหาพ่อกับแม่ แล้วคุยเล่าเขาว่าวันนี้ทำอะไรไปแล้วบ้าง มันช่วยให้พี่ไม่รู้สึกว่าเราอยู่ตัวคนเดียว มันทำให้พี่รู้สึกว่าบ้านของเราอยู่ใกล้แค่เอื้อมมือของพี่เอง`,
    questions: [`คิดถึงบ้านไหม`, `เคยอยากกลับบ้านไหม`],
  },
];
